abstractions
act
add
adds
agent
aggregate
alias
allow
analysis
analyzers
and
ansi
api
app
application
apply
architectural
architecture
archive
are
arrange
assembly
assert
asset
assets
assistance
async
attributes
audit
auto
await
ban
before
bin
binary
both
build
cancellation
change
class
claude
clauses
clean
cli
code
coding
collector
command
common
communication
compilation
compile
complete
config
console
constructor
context
contract
controls
conventions
core
correct
corrupted
coverage
coverlet
cqrs
create
creates
cross
crud
csproj
cycle
data
database
ddd
decision
defaults
delegate
demo
deny
dependencies
dependency
deps
description
design
development
dgspec
different
directory
disposable
dispose
dll
doc
documents
domain
done
dotnet
driven
dto
empty
enable
enabled
engine
entry
equal
equality
error
event
exception
execution
explore
extensibility
extensions
external
fact
factory
fail
fallback
fast
fidelity
fields
file
files
filter
filtering
folders
format
formatter
formatting
forms
framework
frameworks
from
functional
gitignore
global
graph
graphify
green
groups
guard
handle
handler
handling
hans
hant
has
hash
high
hook
hooks
host
https
identifier
ids
implementation
imports
increment
index
inequality
info
injection
inline
input
instance
interface
invalid
inversion
invoke
item
json
layered
layers
level
lib
libraries
lifecycle
like
line
list
load
local
locale
locked
logic
low
management
mandate
marco
mark
marks
mem
memory
metadata
method
microsoft
missing
mock
mode
model
msbuild
multi
multiple
name
naming
net
netcoreapp
netstandard
new
newtonsoft
normal
not
nuget
null
object
observer
only
oop
opc
open
options
order
org
oriented
original
output
package
packages
partner
path
paths
pattern
patterns
payload
pending
permissions
persistence
persists
placeholder
plat
platform
point
post
pre
preserves
priority
private
procedural
program
project
projects
prompt
properties
proposal
propose
props
railway
read
recall
red
refactor
reference
references
reflection
registration
related
reminder
remove
removes
repos
repository
requirements
resource
resources
respect
restore
returns
root
rule
rules
runner
runtime
runtimeconfig
safe
safety
same
save
schema
script
sdk
serialization
serviceable
session
settings
sha
shim
signature
sistec
skill
skills
slash
sort
sorted
sorts
sources
spec
specific
specs
spectre
start
static
status
statusline
storage
string
structure
studio
style
subscriptions
sync
system
tag
target
targeting
targets
task
tasks
tdd
test
testhost
tests
tfm
theory
thinking
thread
throws
todo
todos
token
tool
tools
transitive
type
unique
unsafe
update
updates
use
users
uses
usings
utilities
valid
validation
value
values
version
visual
visualstudio
warn
warning
win
with
xunit